Perpendicular_flap/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;      

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }

    forces_object
   {
    type forces;
    libs ("libforces.so");

    //writeControl outputTime;
    writeControl   timeStep;
    writetInterval  1;

    enabled true;
 
    //// Patches to sample
    patches ("flap" );

    //// Name of fields
    pName p;
    Uname U;

    //only for incompressible flows
    rho rhoInf;
    rhoInf 1;

    //// Centre of rotation
    CofR (0 0 0);
    }

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////

 forceCoeffs_object
 {
    type forceCoeffs;
    libs ("libforces.so");

    enabled true;

    patches ("flap");

    pName p;
    Uname U;

    //only for incompressible flows
    rho rhoInf;
    rhoInf 1;

    //// Dump to file
    log true;

    CofR (0.0 0 0);

    pitchAxis (0 0 1);
    magUInf 1.0;
    lRef 1;		// reference lenght for moments!!!
    Aref 1;		// reference area for force coefficient computation
			// 1.21622 with deployed high lift devices
			// approx 1 in cruise configuration (stowed high lift devices)
			// This is the projected area using a depth of 1 

    writeControl   timeStep;
    writeInterval  1;

         
    liftDir     (0 1 0);			//-sin AOA, cos AOA, 0 AOA in RAD
    dragDir     (1 0 0);			// cos AOA, sin AOA, 0 AOA in RAD

 }
}
